app/controllers/courses_controller.rb

  def index
    @courses = Course.where(nil)
    @courses = @courses.dep(params[:dept_id]) if params[:dept_id].present?
    @courses = @courses.profscope(params[:prof]) if params[:prof].present?
---
SELECT `courses`.* FROM `courses` WHERE (name LIKE '%Strength%' OR prof LIKE '%Strength%')
SELECT `courses`.* FROM `courses` WHERE `courses`.`dept_id` = 1
SELECT `courses`.* FROM `courses` WHERE `courses`.`dept_id` = 1 AND `courses`.`prof` = 'Ramakrishnan\\ S'