app/controllers/depts_controller.rb

SELECT `depts`.* FROM `depts`
---
  def index
    @depts = Dept.all

INSERT INTO `depts` (`name`, `label`, `created_at`, `updated_at`) VALUES ('Engineering Design', 'x', '2017-02-05 23:22:48', '2017-02-05 23:22:48')
---
  def create
    @dept = Dept.new(dept_params)

    if @dept.save